
## Plan Result




<pre><code>Plan: 1 to add, 0 to change, 0 to destroy.</code></pre>

* Create
  * azurerm_key_vault_secret.app_insights_config


<details><summary>Change Result (Click me)</summary>

```hcl

  # azurerm_key_vault_secret.app_insights_config will be created
  + resource "azurerm_key_vault_secret" "app_insights_config" {
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/1c4f0704-a29e-403d-b719-b90c34ef14c9/resourceGroups/reform-scan-aat/providers/Microsoft.KeyVault/vaults/reform-scan-aat"
      + name                    = "notification-service-app-insights-config"
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + value                   = (sensitive value)
      + version                 = (known after apply)
      + versionless_id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
```

</details>




<!-- github-comment: {"Command":"plan","PRNumber":1007,"Program":"tfcmt","SHA1":"","Vars":{}} -->